Revit 2027 API
NonContinuousRailInfo.MaterialId Property
 The material id associated with the non-continuous rail, or invalidElementId if none.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; set; }
Public Property MaterialId As ElementId
	Get
	Set
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MaterialId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The materialId is not a valid value to be used as a non-continuous rail material Id.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace